examples/hello-world/artillery/artillery-test.yml
config:
  target: 'https://0c9lfg7004.execute-api.us-east-1.amazonaws.com/labs'
  phases:
    - duration: 120
      arrivalRate: 30
      number: 2
scenarios:
  - flow:
    - get:
        url: '/go-hello'
    - get:
        url: '/haskell-hello'
    - get:
        url: '/haskell-optimized-hello'
    - get:
        url: '/java-hello'
    - get:
        url: '/js-hello'
    - get:
        url: '/python-hello'
    - get:
        url: '/rust-hello'
    - get:
        url: '/ruby-hello'
    - get:
        url: '/csharp-hello'
    - get:
        url: '/fsharp-hello'